@extends('layout.layout')



@section('content')
<div class="container">
	<div class = "row">
	    <div class = "col-md-12">   	
	    	<div class = "col-md-8">
	    		<h1>Як отримати токен для роботи із API intita.com</h1>
		    	<p> Для початку роботи з АРІ I сайту, потрібно отримати токен - набір символів, призначений для забезпечення інформаційної безпеки користувача, також використовується для ідентифікації його власника, безпечного віддаленого доступу до інформаційних ресурсів. Іншими словами, токен дає можливість використовувати данні, які ви описували в особистому профілі на сайті. І так! Для користування АРІ потрібно для початку заповнити власний профіль.
	    		</p>	
	    		<h3>Крок перший</h3>
	    		<p> Для отримання власного токену потрібно завітати на суб - домен нашого улюбленого сайту. Не суп, a суб - це часнита загального сайту на якій розробники ( а ви розробники, якщо використовуєте АРІ) повинні зареєструватись. 
	    		</p>
	    		<br>
	    			<a class="test-popup-link" href = "img/ssobig.png"><img  src="img/sso.png" class="img-fluid" alt="Responsive image"></a>
	    	    <br>
	    	    <br> 
	    	    <h3>"Сим-сим, откройся!"</h3>
	    		<p> Далі все банально просто.</p>
	    		<br>
	    		<a class="test-popup-link" href = "img/ssoinbig.png"><img src="img/ssoin.png"  class="img-fluid" alt="Responsive image"></a>
	    		<br>
	    		<br> 
	    		<p> На картинці видно, що один токен вже готовий. Такий ви результат отримаєте після генерації. А зараз тицяєм на вкладку "Персональні токени", і ...</p>
	    		<br>
	    		<a class="test-popup-link" href = "img/creatbig.png"><img src="img/creat.png"  class="img-fluid" alt="Responsive image"></a>
	    		<br>
	    		<br> 
	    		<p>Створюємо новий токен. В цьому ж вікні, ви зможете видалити вже існуючий токен. Навіщо це потрібно? Якщо ви не збережете той токен, що з генериться в наступному вікні, побачити ще раз його не вийде. Для цього потрібно буде повторити процедуру від початку. Але перез цим, видалити існуючий, так як два токена мати це вже, вибачте, барскі роскоші!</p>
	    		<p>Що ж, маємо ось таке вікно.</p>
	    		<br> 
	    		<a class="test-popup-link" href = "img/choosebig.png"><img src="img/choose.png"  class="img-fluid" alt="Responsive image"></a>
	    		<br>
	    		<p>Маркуєм, ліпим, клацаєм, кому як довподоби, наступні "чайочки" і називаєм на свій манер. Вуаля!</p>
	    		<br>
	    		<a class="test-popup-link" href = "img/Tokbig.png"><img src="img/Tok.png"  class="img-fluid" alt="Responsive image"></a>
	    		<br> 
	    		<br> 
	    		<p>Зберігаєм "свою прєлєсть" в затишному місці і читаємо наступну статтю, де будем описувати куда і як ці "діла" засовувати.</p>
	
	    	</div>
	    	
	    </div>
	</div>
</div>

@endsection